-- データ作成用
INSERT INTO books VALUES
(1001, 'ネコのひみつ', '2018/1/1', 600, 101, 101),
(1002, '犬にたかられる人', '2020/4/1', 600, 101, 101),
(1003, '星の歌', '2015/5/2',1100 , 102, 102),
(1004, '凹凸', '2012/3/4', 750, 103, 103),
(1005, 'こころ', '2019/2/18', 3850, 104, 104),
(1006, '教師', '2020/12/12', 800, 104, 104),
(1007, '欠けない月はない', '1992/7/7', 1800, 101, 105),
(1008, '明けない夜もある', '2001/9/4', 2530, 102, 105);

INSERT INTO publisher VALUES
(101,'テクノ出版'),
(102,'Axiz文庫');

INSERT INTO author VALUES 
(101,'阿句静'),
(102,'山田太郎'),
(103,'鈴木次郎'),
(104,'手久野子亜'),
(105,'坂田三郎');

